/*--------------------------------------------------------------------------*
 *	ファイル名	： CmBase.h
 *	概要		： 共通基底ヘッダ
 *	作成者		： ITS Y.Node
 *	作成日		： 2015.06.15
 *	(C)Copyright 2015  Automotive & Industrial Systems Company, Panasonic Co.,Ltd
 *	修正履歴	：
 *	2015.06.15 ITS Y.Node  ---------  新規作成
 *--------------------------------------------------------------------------*/

#ifndef _CMBASE_H_
#define _CMBASE_H_

/*--------------------------------------------------------------------------*
 *  クラス名    ： CCmBase
 *  継承クラス  ： 
 *	概要		： 共通基底クラス
 *  作成者      ： ITS Y.Node
 *  作成日      ： 2015.06.15
 *	(C)Copyright 2015  Automotive & Industrial Systems Company, Panasonic Co.,Ltd
 *  修正履歴    ：
 *	2015.06.15 ITS Y.Node  ---------  新規作成
 *--------------------------------------------------------------------------*/
class CCmBase
{
public:
	CCmBase(){}
	virtual ~CCmBase(){}
};

#endif	// End of _CMBASE_H_

/*--------------------------------------------------------------------------*
 *						ファイル(CmBase.h)の終わり
 *--------------------------------------------------------------------------*/
